Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: ནམ་མཁའི་ཕྱག་རྒྱ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་གྲངས་མེད་པ་གཉིས་པ་ལ་བབ་པ་ན་ཤར་ལྷོའི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བྱེ་བ་ཕྲག་འབུམ་གྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Gaganamudra, in the future, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in the southeastern direction beyond as many buddha realms as there are grains of sand in a hundred thousand Ganges Rivers, there will be the world realm known as Padmā.

source: ཁྱོད་དེར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: There you will become enlightened and become a buddha.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དུ་འགྱུར་རོ།
en: You will become the tathāgata named Padmottara, an arhat samyaksam­buddha, one with wisdom and virtuous conduct, a sugata, a knower of the world, a guide who tames beings, an unsurpassable teacher of gods and humans, a buddha, a bhagavat.

source: །བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་གི་དགེ་འདུན་ཡང་ཚད་མེད་པར་འགྱུར་ལ།
en: You will have an innumerable retinue composed entirely of bodhisattvas.

source: ཁྱོད་ཀྱི་ཚེ་ཡང་དཔག་ཏུ་མེད་པར་འགྱུར་ཏེ།
en: Your lifespan will be immeasurable.

source: ཇི་ལྟར་སྨོན་ལམ་བཏབ་པའི་ཡོན་ཏན་དེ་དག་ཐམས་ཅད་དང་ལྡན་པ་ཡང་ཐོབ་པར་འགྱུར་རོ།
en: Your buddha realm will have the entire array of qualities that you have prayed for.’ “

source: །བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་ཕྱག་རྒྱས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་མགོ་བོས་གཏུགས་པ་དང་།
en: The bodhisattva Gaganamudra bowed down his head to the feet of the Tathāgata Ratnagarbha. “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཉོན་མོངས་རྙོག་པ་ཞི་བར་བྱེད་གྱུར་ཅིང་། །ཞིང་རྡུལ་སྙེད་ཀྱི་ཡོན་ཏན་འཆང་གྱུར་པ། །སྔོན་གྱི་རྒྱལ་བཞིན་བྱང་ཆུབ་འཐོབ་འགྱུར་ཞིང་། །འགྲོ་བ་དག་ལ་ཕན་པ་བྱེད་པར་འགྱུར།
en: The Bhagavat said: “ ‘You will be one who brings benefit to beings, One who pacifies the pollution of the kleśas, One who possesses qualities as numerous as the realm’s particles— You will attain enlightenment like the jinas in the past.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་དྲུག་པ་ནམ་མཁའ་ཞེས་བྱ་བ་ལ་སྨྲས་པ་དང་།
en: Then, noble son, the brahmin Samudrareṇu spoke to the sixth prince, who was named Ambara, who made a prayer as the bodhisattva Gaganamudra did.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་འདི་འབའ་ཞིག་ཏུ་མ་ལགས་ཀྱི་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་ཕྱག་རྒྱས་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་བཞིན་ནོ་ཞེས་བྱ་བའི་བར་དུ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ།
en: He said, ‘My buddha realm will not be like this afflicted buddha realm…’ and so on. “

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་ནམ་མཁའ་ཐམས་ཅད་ལས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གདུགས་གསེར་གྱི་དྲ་བ་དག་གིས་གཡོགས་པ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་དྲིལ་བུ་དག་གིས་བརྒྱན་པ་དག་བྱུང་བར་འགྱུར་ཞིང་། གདུགས་དང་། དྲིལ་བུ་དང་།
en: Then he said, ‘Bhadanta Bhagavat, if this wish of mine is to be fulfilled, then in the skies of all the worlds in the ten directions, as numerous as the grains of sand in the Ganges River, may there appear parasols made of the seven jewels, covered with nets of gold, and adorned with bells made of the seven jewels.

source: དྲ་བ་དེ་དག་ལས་ཀྱང་འདི་ལྟ་བུའི་སྒྲ་འབྱུང་བར་གྱུར་ཅིག །འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་།
en: From the parasols, the bells, and the nets, may these words sound: the word Buddha, the word Dharma, the word Saṅgha, the word perfections, the word strengths, the word clairvoyance, and the word confidence.

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒྲ་དང་། སྟོབས་ཀྱི་སྒྲ་དང་། མངོན་པར་ཤེས་པའི་སྒྲ་དང་། མི་འཇིགས་པའི་སྒྲ་དག་འབྱུང་ཞིང་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་སྒྲ་དེ་ལྟ་བུ་དག་ཐོས་པར་གྱུར་ཅིག །
en: May all beings hear those words.

source: དེ་དག་གིས་ཐོས་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཅིག །སེམས་ཅན་གང་དག་སྔོན་འདིར་སེམས་བསྐྱེད་པར་གྱུར་པ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིག །
en: When they have heard them, may they develop the aspiration for the highest, most complete enlightenment, and may the aspiration of those beings who have previously aspired to the highest, most complete enlightenment be irreversible.’ “

source: ཚིག་དེ་སྐད་སྨྲས་མ་ཐག་ཏུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་ནམ་མཁའི་དཀྱིལ་ཐམས་ཅད་ལས་དེ་ལྟ་བུའི་སྒྲ་དག་བྱུང་བའི་བར་དུ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ།
en: As soon as he said that, those words sounded from the sky in all the worlds in the ten directions, as numerous as the grains of sand in the Ganges River, and so on, as before.

source: །བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་བདག་ཉིད་ཀྱིས་ཀྱང་མཐོང་ནས་དེས་ཡང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གིས་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པ་བཞིན་དུ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་དེའི་སླད་དུ་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཡེ་ཤེས་རྣམ་པར་སྣང་བྱེད་ཅེས་བགྱི་བའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འགྱུར་ཞིང་དེས་བདག་གི་དགེ་བའི་ཆོས་རྣམས་གྲུབ་པར་གྱུར་ཅིག །
en: Through the power of the Bhagavat he perceived this himself and said, ‘Bhadanta Bhagavat, if my aspirations are to be completely fulfilled as I have prayed for, then may I in the presence of the Bhagavat attain the illumination by wisdom samādhi, and may that accomplish my good qualities.

source: ཏིང་ངེ་འཛིན་ཐོབ་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་ལུང་སྟོན་པར་གྱུར་ཅིག །
en: When I have obtained that samādhi may the Bhagavat give me his prophecy.’ “

source: བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་ཡེ་ཤེས་རྣམ་པར་སྣང་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པ་དང་།
en: Through the power of the Bhagavat he attained the illumination by wisdom samādhi.

source: །ཁྱོད་ཀྱིས་ནི་སྨོན་ལམ་རྒྱ་ཆེན་པོ་བཏབ་སྟེ།
en: You have made a vast prayer.

source: ཁྱོད་ཀྱི་བསོད་ནམས་ཀྱི་རྒྱུ་འཐུན་པ་དེས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་མང་པོ་དག་ཚད་གཅིག་ཏུ་གྱུར་ལ་ཡིད་དུ་འོང་བའི་སྒྲ་འབུམ་ཕྲག་མང་པོ་དག་གིས་བསྐུལ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་རིགས་ཀྱི་བུ་ཁྱོད་རྣམ་པར་སྣང་བྱེད་ཅེས་བྱ་བར་གྱུར་ཅིག །
en: Through the effect of this merit, noble son, worlds in the ten directions as numerous as the grains of sand in the Ganges River have become buddha realms inspired by hundreds of thousands of beautiful words. Therefore, you should be known as Vegavairocana.

source: རྣམ་པར་སྣང་བྱེད་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ནས་གྲངས་མེད་པ་གཉིས་པ་ལ་བབ་པ་ན། ཤར་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཉི་ཟླ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Vegavairocana, in a future time, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, there will be, in the eastern direction, beyond as many worlds as there are grains of sand in the Ganges River, a world realm called Ādityasomā.

source: དེར་ཁྱོད་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: There you will attain the complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ལ་དབང་སྒྱུར་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དུ་འགྱུར་རོ།
en: You will become the tathāgata named Dharmavaśavartīśvararāja, an arhat samyaksam­buddha, one with wisdom and virtuous conduct, a sugata, a knower of the world, a guide who tames beings, an unsurpassable teacher of gods and humans, a buddha, a bhagavat.’ “

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བྱེད་ཀྱིས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་པ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ།
en: The bodhisattva Vegavairocana bowed down the five parts of his body to the feet of the Tathāgata Ratnagarbha.

source: བརྟུལ་ཞུགས་བཟང་པོ་རབ་དགའ་སེམས་དུལ་ལོངས། །བླ་མེད་སངས་རྒྱས་བྱང་ཆུབ་མ་གཏོགས་པར། །སེམས་ཅན་དག་ལ་སྙིང་རྗེ་ཆེར་སྐྱེད་ལ། །སྡུག་བསྔལ་རྒྱ་མཚོའི་མཐར་གནས་སེམས་ཅན་སྒྲོལ།
en: The Bhagavat said: “ ‘Arise, you with excellent discipline, great joy, and a subdued mind, Having brought forth great, powerful compassion for beings, Save beings and stand on the shore of the ocean of suffering, As long as you have not attained the highest, complete enlightenment.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་བདུན་པ་ཡན་ལག་སྐྱེས་ཞེས་བྱ་བ་ལ་སྨྲས་པ་དང་། སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ།
en: Then, noble son, the brahmin Samudrareṇu spoke to the seventh prince, who was named Aṅgaja, and it proceeded as before.

source: བདག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་འདི་འབའ་ཞིག་ཏུ་མ་ལགས་ཀྱི་གང་ན་སེམས་ཅན་དམྱལ་བ་མ་མཆིས་པ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་མ་མཆིས་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་མ་མཆིས་པ་དང་། བུད་མེད་མ་མཆིས་པ་དང་། སེམས་ཅན་མངལ་ན་གནས་པ་དག་མ་མཆིས་པ་དང་། རི་རབ་མ་མཆིས་པ་དང་། ཁོར་ཡུག་མ་མཆིས་པ་དང་། ཁོར་ཡུག་ཆེན་པོ་དག་མ་མཆིས་པ་དང་། བྲག་དང་རི་དག་མ་མཆིས་པ་དང་། མཐོ་དམན་དང་། གསེག་མ་དང་། གྱོ་མོ་དང་། ཚེར་མ་དང་། ཚང་ཚིང་དག་མ་མཆིས་པ་དང་། ཤིང་ལྗོན་པ་དག་མ་མཆིས་པ་དང་།
en: Prince Aṅgaja said, ‘May I attain the complete enlightenment of perfect buddhahood not in a buddha realm like this afflicted buddha realm, but in one in which there are no hells, no animals, no world of Yama, no females, no beings inside wombs, no Sumeru, no Cakravāḍa, no Mahācakravāḍa, no soil, no rocks, no mountains, no uneven ground, no pebbles, no gravel, no thorns, no thickets, no wooden trees, and no oceans.

source: རྒྱ་མཚོ་ཆེན་པོ་དག་མ་མཆིས་པ་དེར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །དེ་ན་ཉི་མ་དང་ཟླ་བ་དག་མ་མཆིས་པ་དང་། སྐར་མའི་གཟུགས་རྣམས་མ་མཆིས་པ་དང་། ཉིན་མོ་དང་མཚན་མོ་མ་མཆིས་པ་དང་། མུན་པ་ཐིབས་པོ་མ་མཆིས་པ་དང་། དེ་ན་སེམས་ཅན་རྣམས་ལ་བཤང་བ་དང་། གཅི་བ་དང་། མཆིལ་མ་དང་།
en: May there be no sun and moon, no stars, no day and night, and no darkness.

source: སྣབས་དག་མ་མཆིས་པ་དང་། ལུས་ཀྱི་རྔུལ་དང་། དྲི་ང་བ་མ་མཆིས་པ་དང་། སེམས་ཅན་རྣམས་ལ་ལུས་ངལ་བ་མ་མཆིས་པ་དང་། སེམས་ངལ་བ་མ་མཆིས་པར་གྱུར་ཅིག །
en: May the beings there have no feces, urine, spittle, or snot; may they have no sweat and no odor; may they have no physical fatigue and no mental fatigue.

source: དེ་ན་འཐུལ་བ་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there be no dusty ground.

source: དེ་ནས་གཞི་ཐམས་ཅད་རིན་པོ་ཆེའི་རྡོའི་སྙིང་པོ་ལས་གྲུབ་པར་གྱུར་ཅིག ། རིན་པོ་ཆེ་འབུམ་ཕྲག་དུ་མས་བརྒྱན་ཅིང་མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དག་བཀྲམ་པར་གྱུར་ཅིག །སངས་རྒྱས་ཀྱི་ཞིང་དེར་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་སྣ་ཚོགས་དག་གིས་བརྒྱན་པར་གྱུར་ཅིག །
en: May the entire ground be made of emerald; may it be adorned by hundreds of thousands of jewels.

source: རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་དེ་དག་ཀྱང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲ་བ་དག་གིས་བརྒྱན་པར་གྱུར་ཅིག །
en: May it be strewn with coral trees and great coral tree flowers.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རས་བཅོས་བུ་དག་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་གོས་དག་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་དག་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ལྷབ་ལྷུབ་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པར་གྱུར་ཅིག །རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་དེ་དག་ལ་མེ་ཏོག་ཕྲེང་སྣ་ཚོགས་དག་དང་།
en: May that buddha realm be adorned by a variety of precious trees; may those precious trees be adorned by nets of jewels; and may those precious trees be adorned with a variety of precious cotton cloths, a variety of precious clothing, a variety of precious beads, a variety of precious hanging ornaments, a variety of flower garlands, a variety of musical instruments, a variety of precious vessels, and a variety of flowers. “ ‘

source: རོལ་མོའི་སྒྲ་སྣ་ཚོགས་དག་དང་། རིན་པོ་ཆེའི་སྣོད་སྣ་ཚོགས་དག་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་དག་གིས་བརྒྱན་པར་གྱུར་ཅིག །དེ་ན་གང་གི་ཚེ་མེ་ཏོག་དག་ཁ་ཟུམས་ཤིང་རོལ་མོའི་སྒྲ་དག་མི་གྲག་པ་མ་གཏོགས་པར་མཚན་མོ་མི་མངོན་པར་གྱུར་ཅིག །
en: May the only indication of night be when the flowers close and the sound of music ceases.

source: མེ་ཏོག་ཁ་ཟུམས་པ་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའ་དག་སྐྱེ་བར་གྱུར་ཅིག །
en: May bodhisattvas be born from within the closed flowers.

source: དེར་བྱང་ཆུབ་སེམས་དཔའ་སྙོམས་པར་ཞུགས་པ་ན་ཏིང་ངེ་འཛིན་སྣང་བ་བཀོད་པ་ཞེས་བགྱི་བ་ཐོབ་པར་གྱུར་ཅིག །
en: May the bodhisattvas, resting in meditation, attain the samādhi called an array of visions.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་པས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ན་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་མཐོང་བར་གྱུར་ཅིག །
en: Through attaining that samādhi may they see the bhagavat buddhas who reside, live, and remain in other realms in the ten directions as numerous as the particles in a buddha realm.

source: སྐད་ཅིག་དེ་ཉིད་ལ་གང་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་ཆོས་འཆད་པ་ཐོས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ལྷའི་རྣ་བ་རྣམ་པར་དག་པ་ཐོབ་པར་གྱུར་ཅིག །
en: In that instant may they attain the pure divine hearing so that they hear the Dharma teaching of the bhagavat buddhas in the other realms in the ten directions, which are as numerous as the particles in a buddha realm. “ ‘

source: སེམས་ཅན་དག་སྐྱེས་མ་ཐག་ཏུ་ཐམས་ཅད་ཀྱིས་ཚེ་རབས་རྗེས་སུ་དྲན་པར་འགྱུར་ཞིང་། དེ་དག་གིས་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་རྗེས་སུ་དྲན་པར་གྱུར་ཅིག །
en: May all beings, as soon as they are born there, remember their former lives and remember eons as numerous as the particles in a buddha realm.

source: སེམས་ཅན་དེ་དག་སྐྱེས་མ་ཐག་ཏུ་ཐམས་ཅད་ཀྱིས་ཕྱོགས་བཅུ་ཀུན་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ། སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་མཐོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ལྷའི་མིག་ཐོབ་པར་གྱུར་ཅིག །
en: May all those beings, as soon as they are born, obtain divine sight so that they see the arrays of qualities of buddha realms as numerous as the particles in a buddha realm, everywhere in the ten directions.

source: སེམས་ཅན་དེ་དག་སྐྱེས་མ་ཐག་ཏུ་ཐམས་ཅད་ཀྱིས་སྐད་ཅིག་གཅིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་གིས་སེམས་ཅན་ཐམས་ཅད་སེམས་ཀྱི་སྤྱོད་པ་འཚལ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་ལ་མཁས་པ་དང་ལྡན་པར་འགྱུར་ཞིང་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་ཅིང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་ཏིང་ངེ་འཛིན་དེ་ཆུད་མི་ཟ་བར་གྱུར་ཅིག །
en: May all those beings, as soon as they are born, be skilled in knowing the minds of others, so that in one instant they know the mental activity of beings within buddha realms as numerous as the particles in a buddha realm, and until their enlightenment and parinirvāṇa may all those beings honor that samādhi. “ ‘

source: ནང་པར་སྔར་ཕྱོགས་བཞི་ནས་དྲི་ཤིན་ཏུ་བདའ་ཞིང་དགའ་བར་བགྱིད་ལ་འཇམ་ཞིང་རེག་ན་བདེ་བའི་བསེར་མའི་ངད་ལྡང་བར་འགྱུར་ཞིང་མེ་ཏོག་དེ་དག་ཀྱང་ཁ་འབྱེད་པར་གྱུར་ཅིག །
en: In the morning may there come from the four directions very aromatic, delightful, soft, blissfully cool breezes that cause the flowers to open.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་ཏིང་ངེ་འཛིན་དེ་དག་ལས་ལངས་ཤིང་། མེ་ཏོག་གི་ཟེ་བ་དེ་དག་ལས་ལྡང་བར་གྱུར་ཅིག །
en: May the bodhisattvas arise from their samādhi and get up from the anthers of the flowers.

source: གང་གིས་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་ཕྱོགས་རེ་རེར་ཡང་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཏུ་མཆིས་ཤིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་པ་རྣམས་ལ་ཕྱག་བགྱིས་ནས་སླར་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་གྱི་ཡུལ་ཡང་ཐོབ་པར་གྱུར་ཅིག །
en: May they have the miraculous power to, in one instant of mind, go to pay homage to the bhagavat buddhas who in every direction reside, live, and remain in realms that are as numerous as the particles in a buddha realm, and then return.

source: དེ་ན་མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོའི་ཟེ་བ་དག་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་མཆི་བར་འགྱུར་ཞིང་ཆོས་ཀྱི་བདེ་བ་ཡིད་ལ་བགྱིད་པས་དེ་བཞིན་གཤེགས་པ་ལ་ལྟ་བར་གྱུར་ཅིག །
en: May they then be seated cross-legged upon the anthers of coral tree flowers and great coral tree flowers and gaze at the Tathāgata with minds made blissful by the Dharma. “ ‘

source: གང་དང་གང་དུ་མཆིས་སམ་ལྡོག་པའི་ཕྱོགས་ཐམས་ཅད་དུ་བདག་ཀྱང་མཐོང་བར་གྱུར་ཅིག །
en: In all directions, wherever they go, whether they are seated there or returning, may they see me.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་ཆོས་རྣམས་ལ་ནེམ་ནུར་དང་ཡིད་གཉིས་དང་ཐེ་ཙོམ་ཇི་ལྟ་བུ་དག་སྐྱེ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་བདག་ལ་བལྟས་ཤིང་མཐོང་བ་ཙམ་གྱིས་བྲལ་བར་གྱུར་ཅིག །
en: Whatever equivocation, uncertainty, or doubt about the Dharma arises among those bodhisattva mahāsattvas, may they be freed from it just by seeing me.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཆོས་བསྟན་པ་ཇི་ལྟ་བུ་དག་འཚལ་བ་དེ་ལྟ་བུའི་ཆོས་བསྟན་པ་དག་བདག་ལ་བལྟས་པ་ཙམ་གྱིས་འཚལ་བར་གྱུར་ཅིག །
en: Whatever Dharma teaching those bodhisattva mahāsattvas wish for, may they receive that Dharma teaching simply by looking at me.

source: དེ་ན་སེམས་ཅན་རྣམས་བདག་གི་བ་མ་མཆིས་ཤིང་། ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པར་འགྱུར་ཞིང་། ཐ་ན་རང་གི་ལུས་དང་སྲོག་ལ་ཡང་དོན་དུ་གཉེར་བ་མ་མཆིས་པར་གྱུར་ཅིག །
en: May those beings have no ownership and no attachments, to the extent that they have no preoccupation even with their own bodies and lives.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པ་ཤ་སྟག་ཏུ་གྱུར་ཅིག །
en: May all those bodhisattvas be irreversible. “ ‘

source: དེ་ན་མི་དགེ་བའི་མིང་ཡང་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there not even be the word bad there.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བསླབ་པ་ལེན་པའི་མིང་ཡང་མ་མཆིས་ལ། ལྟུང་བྱེད་ལས་སློང་བའི་བར་གྱི་བཀའ་མཆིད་ཀྱང་མ་མཆིས་པར་གྱུར་ཅིག །
en: In that buddha realm, may there not even be the word training, and so on, as before, and may there be no mention of removing faults.

source: སེམས་ཅན་ཐམས་ཅད་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པར་གྱུར་ཅིག །
en: May all those beings have the thirty-two signs of a great being.

source: ཐམས་ཅད་སྲེད་མེད་ཀྱི་བུའི་སྟོབས་དང་ལྡན་པར་གྱུར་ཅིག །
en: May they all have the power of Nārāyaṇa.

source: དེ་ན་བྱང་ཆུབ་ཅིང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་སེམས་ཅན་གཅིག་ཀྱང་དབང་པོ་མ་ཚང་བར་མ་གྱུར་ཅིག །
en: May not a single being have impaired faculties during the time before their enlightenment and nirvāṇa.

source: དེ་ན་སེམས་ཅན་ཐམས་ཅད་སྐྲ་བྲེགས་ཤིང་གོས་ངུར་སྨྲིག་སར་པ་དག་འཚལ་བཞིན་དུ་སྐྱེ་བར་གྱུར་ཅིག །
en: May all the beings there be born with shaved heads and wearing new saffron-colored robes.

source: ཤིན་ཏུ་རྣམ་པར་འབྱེད་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་ཡང་ཆུད་མི་ཟ་བར་གྱུར་ཅིག །
en: May they attain the samādhi of complete discernment and never lose it until enlightenment.

source: དེ་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱང་དགེ་བའི་རྩ་བ་དང་འགྲོགས་པར་གྱུར་ཅིག །
en: May all the beings there be accompanied by good roots. “ ‘

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་ཐམས་ཅད་ལ་ན་བ་དང་རྒ་བའི་སྡུག་བསྔལ་མ་མཆིས་པར་གྱུར་ཅིག །
en: In that buddha realm may beings have no knowledge of the suffering of illness and aging. When their lifespan is over, may they all enter nirvāṇa sitting cross-legged.

source: སེམས་ཅན་གང་དག་ཚེ་ཡོངས་སུ་བས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་སྐྱིལ་མོ་ཀྲུང་གིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ཞིང་རང་གི་ལུས་ལས་མེའི་ཁམས་བྱུང་སྟེ།
en: May fire rise from their bodies and burn up their bodies.

source: དེས་རང་གི་ལུས་བསྲེགས་པར་གྱུར་ནས་ཕྱོགས་བཞི་ནས་བསེར་མ་དག་ལངས་ཤིང་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྐུ་གདུང་དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དག་ཏུ་འཐོར་ཞིང་། འདི་ལྟ་སྟེ་དཔེར་བགྱི་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་ནོར་བུ་རིན་པོ་ཆེའི་འོད་གསལ་བ་དེ་ལྟ་བུའི་ནོར་བུ་རིན་པོ་ཆེ་དག་ཀྱང་འབྱུང་བར་གྱུར་ཅིག །
en: May a breeze from the four directions carry their relics to a thousand buddha realms, where they will appear as precious jewels that are like the bright precious jewel of a cakravartin king.

source: དེ་ན་སེམས་ཅན་གང་དག་གིས་ནོར་བུ་རིན་པོ་ཆེའི་འོད་དེ་དག་མཐོང་བར་གྱུར་ཏམ། ནོར་བུ་རིན་པོ་ཆེ་དེ་དག་མཐོང་བར་གྱུར་ཏམ། དེ་དག་ལ་རེག་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་ཅིང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་མི་མྱོང་བར་གྱུར་ཅིག །
en: May any being who sees the light of those precious jewels, or sees the precious jewels themselves, or touches them, until they reach enlightenment and nirvāṇa, never experience the suffering of hells, animals, or Yama’s world.

source: དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་གང་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་པ་དེར་སྐྱེ་བར་གྱུར་ཅིག །
en: When beings pass away, may they be born where the bhagavat buddhas reside, live, and remain, teaching the Dharma to beings.

source: སེམས་ཅན་དེ་དག་དེར་སྐྱེས་ནས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་ཆོས་ཐོས་པར་འགྱུར་ཞིང་དེ་དག་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་ཡང་གྱུར་ཅིག །
en: When those beings have been born there may they hear the Dharma from the bhagavat buddhas and develop the aspiration for enlightenment.

source: སེམས་བསྐྱེད་མ་ཐག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་སླར་མི་ལྡོག་པར་གྱུར་ཅིག །
en: As soon as they have developed that aspiration, may they never turn back from the highest, most complete enlightenment. “ ‘

source: བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སེམས་ཅན་འགའ་ཡང་མཉམ་པར་མ་བཞག་པ་དང་། སྡུག་བསྔལ་གྱི་ཚོར་བ་དང་། གཅིག་ལ་གཅིག་འགུམས་པར་འགྱུར་བའི་གནོད་སེམས་ཀྱི་སེམས་དང་མ་བྲལ་བར་འགུམ་པའི་དུས་བགྱིད་པར་མ་གྱུར་ཅིག །
en: In my buddha realm may there be no beings who die while not in a state of meditation, while experiencing suffering, or not free from the malicious intent to kill one another.

source: དེ་སླན་ཆད་མི་ཁོམ་པ་རྣམས་སུ་སྐྱེ་བར་མ་གྱུར་ཅིག །
en: Subsequently, may they never be reborn into an unfavorable existence.

source: སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་རྣམས་སུ་སྐྱེ་བར་མ་གྱུར་ཅིག །
en: May they never be reborn in a realm devoid of a buddha.

source: བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བར་གྱུར་ཅིག །
en: Until they reach enlightenment may they never be unable to see a buddha.

source: ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བགྱིད་པ་དང་མི་འབྲལ་བར་གྱུར་ཅིག །
en: May they never be unable to hear the Dharma or serve the saṅgha. “ ‘

source: དེ་ན་སེམས་ཅན་ཐམས་ཅད་ཐ་བ་དང་ཞེ་སྡང་བ་དང་། འཆབ་པ་དང་། ཕྲག་དོག་དང་། སེར་སྣ་དང་བྲལ་བར་གྱུར་ཅིག །
en: May all beings in my buddha realm be free of obstinacy, anger, hypocrisy, envy, and selfishness.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམ་པར་སྤངས་པར་གྱུར་ཅིག །
en: May śrāvakas and pratyekabuddhas be absent.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་བྱང་ཆུབ་སེམས་དཔའ་ཤ་སྟག་གིས་གང་བར་གྱུར་ཅིག །
en: May the buddha realm be filled with pure bodhisattvas.

source: སེམས་ཅན་གང་དག་དེར་སྐྱེ་བར་འགྱུར་བ་དག་འཇམ་པའི་སེམས་དང་། མཉེན་པའི་སེམས་དང་། ཁོན་མེད་པའི་སེམས་དང་། གདུག་པ་མེད་པའི་སེམས་དང་། ཞི་བའི་སེམས་དང་།
en: May the beings who are born there be agreeable, gentle, forgiving, good, peaceful, and meditative. “ ‘

source: མཉམ་པར་བཞག་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཅིག །བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་འོད་གསལ་བར་གྱུར་ཅིག །
en: May my buddha realm be radiant.

source: བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཡོན་ཏན་ཆེན་པོ་བཀོད་པ་དང་ལྡན་པར་གྱུར་ཅིག །
en: May my buddha realm have a great array of qualities.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དག་ནས་ཀྱང་བདའ་ཞིང་དྲིས་ཁྱབ་པར་གྱུར་ཅིག །
en: May it be seen in the worlds in the ten directions, which are as numerous as the particles in a buddha realm, and may its aroma pervade them. “ ‘

source: དེ་ན་སེམས་ཅན་དག་རྟག་ཏུ་བདེ་བ་དང་ལྡན་པར་གྱུར་ཅིག །
en: May the beings there always have happiness.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སྡུག་བསྔལ་གྱི་སྒྲ་ཡང་མི་གྲག་པར་གྱུར་ཅིག །
en: May the word suffering never be heard there. “ ‘

source: ཇི་སྲིད་དུ་བདག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་དེ་ལྟ་བུ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་འཇོག་པར་འགྱུར་བ་དེ་སྲིད་དུ་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: I will carry out the conduct of a bodhisattva such that I, as a bodhisattva, will establish a pure buddha realm endowed with this kind of array of a buddha realm’s qualities, and I will fill that buddha realm with such beings who have pure minds.

source: །བསམ་པ་ཡོངས་སུ་དག་པའི་སེམས་ཅན་དེ་ལྟ་བུ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཁྱབ་པར་བཀོད་ལ་དེའི་འོག་ཏུ་བདག་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་འཚང་རྒྱ་བར་བགྱིའོ།
en: Subsequently, in that buddha realm I will become a buddha with the highest, most complete enlightenment.

source: །བདག་བྱང་ཆུབ་ཐོབ་པ་ན། འོད་དཔག་ཏུ་མ་མཆིས་པར་གྱུར་ཅིག །
en: When I attain enlightenment, may I have limitless radiance.
